#!/bin/bash

#############################################################################################
# 脚本信息
#############################################################################################
# 作者：Dylan <1214966109@qq.com>   
# 用途：一键编译安装 NGINX
# 系统：CentOS 7.x
# 时间：2019-07-27 14:45
#############################################################################################

#############################################################################################
# 脚本规范说明
#############################################################################################   
# 1. 安装包名称，版本都会以单独的变量单独定义组合，且抽离在脚本最前面便于维护
# 2. 变量 / 函数名称 / 数组都将使用全大写加下划线的形式，如：PLG_NGX_ECHO
# 3. 各个分类都将以单独的名称开始
#     普通变量：VAR_XXX_XXX
#     插件变量：PLG_XXX_XXX
#     包名变量：PKG_XXX_XXX
#     版本变量：VER_XXX
#     函数名称：FUNC_XXX_XXX
#     数组名称：ARR_XXX_XXX
#############################################################################################

#############################################################################################
# 脚本功能说明
#############################################################################################   
#   
#############################################################################################

#############################################################################################
# 导入系统变量
#############################################################################################
. /etc/init.d/functions
source /etc/profile

#############################################################################################
# 服务变量定义
#############################################################################################
PATH_NGX_BASE_INSTALL='/data/services/nginx'
PATH_NGX_LOG='/data/logs/nginx'



#############################################################################################
# 颜色和线条输出函数
#############################################################################################
function FUNC_COLOR_TEXT() {
  echo -e " \e[0;$2m$1\e[0m"
}

function FUNC_ECHO_RED() {
  echo $(FUNC_COLOR_TEXT "$1" "31")
}

function FUNC_ECHO_GREEN() {
  echo $(FUNC_COLOR_TEXT "$1" "32")
}

function FUNC_ECHO_YELLOW() {
  echo $(FUNC_COLOR_TEXT "$1" "33")
}

function FUNC_ECHO_BLUE() {
  echo $(FUNC_COLOR_TEXT "$1" "34")
}

LINE='---------------------------------------------------------------------------------------'

#############################################################################################
# 颜色通知输出函数
#############################################################################################
# 通知信息
function FUNC_ECHO_INFO() {
  echo $(FUNC_COLOR_TEXT "${LINE}" "33")
  echo $(FUNC_COLOR_TEXT "$1" "33")
  echo $(FUNC_COLOR_TEXT "${LINE}" "33")
}

# 完成信息
function FUNC_ECHO_SUCCESS() {
  echo $(FUNC_COLOR_TEXT "${LINE}" "32")
  echo $(FUNC_COLOR_TEXT "$1" "32")
  echo $(FUNC_COLOR_TEXT "${LINE}" "32")
}

# 错误信息
function FUNC_ECHO_ERROR() {
  echo $(FUNC_COLOR_TEXT "${LINE}" "31")
  echo $(FUNC_COLOR_TEXT "$1" "31")
  echo $(FUNC_COLOR_TEXT "${LINE}" "31")
}

#############################################################################################
# 系统版本检测函数
#############################################################################################
function FUNC_SYSTEM_CHECK() {
  FUNC_ECHO_INFO 'STEP 1：系统检测进行中...'
  VAR_SYSTEM_FLAG=$(/usr/bin/cat /etc/redhat-release | grep 'CentOS' | grep '7' | wc -l)
  if [[ ${VAR_SYSTEM_FLAG} -ne 1 ]];then
    FUNC_ECHO_ERROR '本脚本基于 CentOS 7 编写，目前暂不支持其他版本系统！'
    exit 1
  fi
}

#############################################################################################
# 服务器联网函数
#############################################################################################
function FUNC_NETWORK_CHECK() {
  FUNC_ECHO_INFO 'STEP 2：网络检测进行中...'
  VAR_PING_NUM=$(/usr/bin/ping -c 3 www.baidu.com | grep 'icmp_seq' | wc -l)
  if [[ ${VAR_PING_NUM} -ne 0 ]];then
    FUNC_ECHO_ERROR '网络连接失败，请先配置好网络连接...'
    exit 2
  fi
}













